#include <stdio.h>
#include <math.h>
Напиши програма каде преку тастатура ќе може да се внесат два цели броеви.
Ако двата броеви се позитивни да се пресмета квадрат од нивната сума, во
спротивно да се пресмета сума од нивните квадрати.
Резултатот да се отпечати на екран.
int main() {
    int x, y;
    printf("Enter two numbers: ");
    scanf("%d %d", &x, &y);

    if (x > 0 && y > 0) {
        printf("%d\n", (int)pow(x + y, 2));
    } else {
        printf("%f\n", pow(x, 2) + pow(y, 2));
    }

    return 0;
}
